#!/usr/bin/python
# -*- coding: utf-8 -*-

# Вывести на экран таблицу умножения на 3.

for i in range(1, 11):
    print('%d x %d = %d' % (3, i, 3 * i))
