#!/usr/bin/python
# -*- coding: utf-8 -*-

# Написать функцию, вычисляющую сумму двух переданных чисел.

def sum(x, y):
    return x + y


print(sum(1, 1))
print(sum(1, 2))
print(sum(1, 1.6))
